Tekla Open API Reference for Tekla Structures 2025
OBB.Intersects Method (LineSegment)
 Tests if current OBB intersects with the given LineSegment
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Intersects(
	LineSegment lineSegment
)
Public Function Intersects (
	lineSegment As LineSegment
) As Boolean
Parameters
lineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
LineSegment to test against
Return Value
Type: Boolean
True if the OBB intersects with the given LineSegment, otherwise false
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the lineSegment parameter.
See Also
Reference
OBB Class
Intersects Overload
Tekla.Structures.Geometry3d Namespace